{"data":[{"Question":"What do you mean by Network?"," Answer":"Set of devices connected to each other over the physical medium is known as a computer network. For example the Internet.","qword":"network"},{"Question":"What do you mean by Node?"," Answer":" \"In the computer network"},{"Question":"What do you mean by Network Topology?"," Answer":"A network topology is a physical structure of the network which defines how the computers or node will be connected to each other.","qword":"network"},{"Question":"What is a Router?"," Answer":"Router is a device responsible for routing and forwarding data between source and destination over the computer network.","qword":"router"},{"Question":"What is the OSI model?"," Answer":"OSI model stands for Open System Interconnection. It’s a reference model which describes that how different applications will communicate to each other over the computer network.","qword":"osi"},{"Question":"Describe Hub, Switch and Router?"," Answer":"Hub broadcasts all data to every port. It has a common connection point for all devices. Switch creates the dynamic connection and provide information to the requesting port. Router is the device which will be responsible for forwarding data packets."},{"Question":"What are the different Layers of TCP/IP Model?"," Answer":" Application Layer, Transport Layer, Network or Internet Layer, Data Link Layer and Physical Layer.","qword":"tcp"},{"Question":"What do you mean by HTTP? What is the port number for the same?"," Answer":"HTTP stands for Hyper Text Transfer Protocol and the port for this is 80.","qword":"http"},{"Question":"What do you mean by a Firewall?"," Answer":"Firewall is a concept of a security system that will helps computers to protect it with unauthorized access or any cyber-attack.","qword":"firewall"},{"Question":"What do you mean by DNS?"," Answer":"DNS Stands for Domain Name System. It’s an internet address mapping process with the local name. We can also call it as an internet phonebook.","qword":"dns"},{"Question":"What is the work of a Proxy server?"," Answer":"Proxy server prevents the external users which are unauthorized to access the network.","qword":"proxy"},{"Question":"What is NIC?"," Answer":" \"NIC stands for Network interface card. It is an adapter that will be installed on the computer and because of that NIC","qword":"nic"},{"Question":"What does ASCII stand for?"," Answer":"ASCII stands for American Standard Code for Information Interchange."},{"Question":"What is SLIP Protocol?"," Answer":"SLIP stands for Serial Line Interface Protocol. It is used for sending IP datagram over a network in a single line."},{"Question":"What are the key elements of the protocol?"," Answer":" \"There are 3 key elements of a protocol - Syntax, Semantics and Timings."},{"Question":"What is a decoder?"," Answer":"A decoder is a program which converts the encrypted data into its actual format."},{"Question":"What is the role of IEEE in the world of computer network?"," Answer":"IEEE or Institute of Electrical and Electronic Engineers is used to define and develop the standards which will be used over the network."},{"Question":"What is 127.0.0.1 and localhost?"," Answer":" \"The IP address 127.0.0.1 is reserved for localhost connections. These local host networks are reserved for the biggest customers or some essential people on the internet. To check whether the localhost server is working fine"},{"Question":"How is VPN used in the corporate world?"," Answer":" \"A Virtual Private Network allows remote users to connect to an organization’s network securely. All companies, educational institutions make use of VPNs so that users can access the networks remotely."},{"Question":"What are the uses of cross and standard cables?"," Answer":" \"A straight cable can be used to connect a computer to a switch"},{"Question":"What is the difference between a host and an end system? List several different types of end systems."," Answer":" \"There is no difference.  End systems include PCs, Workstations, Web Servers etc."},{"Question":"What are some of the physical media Ethernet can run over?"," Answer":"Ethernet most commonly runs over twisted-pair copper wire. It can also run over fiber optic links."},{"Question":"Why will two ISPs at the same level of the hierarchy often peer with each other?"," Answer":" \"If the two ISPs do not peer with each other they will have to send the traffic through a provider ISP (intermediary), to which they have to pay for carrying the traffic. By peering with each other directly, the two ISPs can reduce their payments to their provider ISPs."},{"Question":"How does an IXP earn money?"," Answer":" \" An IXP earns its money by charging each of the ISPs that connect to the IXP a relatively small fee"},{"Question":"What are the layers of the OSI reference model?"," Answer":" \"There are 7 OSI layers: 1) Physical Layer"},{"Question":"What is the backbone network?"," Answer":"A backbone network is a centralized infrastructure that is designed to distribute different routes and data to various networks. It also handles the management of bandwidth and multiple channels."},{"Question":"What is a node?"," Answer":"A node refers to a point or joint where a connection takes place. It can be a computer or device that is part of a network. Two or more nodes are needed to form a network connection."},{"Question":"What is a point to point link?"," Answer":"It refers to a direct connection between two computers on a network. A point to point connection does not need any other network devices other than connecting a cable to the NIC cards of both computers."},{"Question":"What is anonymous FTP?"," Answer":" \"Anonymous FTP is a way of granting user access to files in public servers. Users that are allowed access to data in these servers do not need to identify themselves"},{"Question":"What is a subnet mask?"," Answer":" \"A subnet mask is combined with an IP address to identify two parts: the extended network address and the host address. Like an IP address"},{"Question":"What is data encapsulation?"," Answer":" \"Data encapsulation is the process of breaking down information into smaller manageable chunks before it is transmitted across the network. In this process that the source and destination addresses are attached to the headers, along with parity checks."},{"Question":"Briefly describe NAT."," Answer":"NAT stands for Network Address Translation. This is a protocol that provides a way for multiple computers on a common network to share a single connection to the Internet."},{"Question":"How does a network topology affect your decision to set a network?"," Answer":" \"Network topology dictates what media you must use to interconnect devices. It also serves as a basis on what materials"},{"Question":"What is the importance of the OSI Physical Layer?"," Answer":" \"The physical layer does the conversion from data bits to the electrical signal"},{"Question":"What is the function of the OSI Session Layer?"," Answer":" \"This layer provides the protocols and means for two devices on the network to communicate with each other by holding a session. This includes setting up the session"},{"Question":"What is DoS attack?"," Answer":" \"DoS or Denial-of-Service attack, is an attempt to prevent users from being able to access the Internet or any other network services. Such attacks may come in different forms and are done by a group of perpetrators. One common method of doing this is to overload the system server so it cannot anymore process legitimate traffic and will be forced to reset."},{"Question":"What are MAC addresses?"," Answer":" \"MAC"},{"Question":"How can you identify the IP class of a given IP address?"," Answer":" \"By looking at the first octet of any given IP address"},{"Question":"What are gateways?"," Answer":"Gateways provide connectivity between two or more network segments. It is usually a computer that runs the gateway software and provides translation services. This translation is key in allowing different systems to communicate on the network."},{"Question":"What is the disadvantage of a star topology?"," Answer":" \"One major disadvantage of star topology is that once the central Hub or switch gets damaged"},{"Question":"What is tracert?"," Answer":"Tracert is a Windows utility program that can use to trace the route taken by data from the router to the destination network. It also shows the number of hops taken during the entire transmission route."},{"Question":"What is a Hybrid Network?"," Answer":"A hybrid network is a network setup that makes use of both client-server and peer-to-peer architecture."},{"Question":"What is DHCP?"," Answer":" \"DHCP is short for Dynamic Host Configuration Protocol. Its main task is to assign an IP address to devices across the network automatically. It first checks for the next available address not yet taken by any device"},{"Question":"What is the main job of the ARP?"," Answer":"The main task of the ARP or Address Resolution Protocol is to map a known IP address to a MAC layer address."},{"Question":"What is the use of a default gateway?"," Answer":"Default gateways provide means for the local networks to connect to the external network. The default gateway for connecting to the external network is usually the address of the external router port."},{"Question":"What happens when you use cables longer than the prescribed length?"," Answer":"Cables that are too long would result in signal loss. It means that data transmission and reception would be affected because the signal degrades over length."},{"Question":"What is ICMP?"," Answer":"ICMP is an Internet Control Message Protocol. It provides messaging and communication for protocols within the TCP/IP stack. This is also the protocol that manages error messages that are used by network tools such as PING."},{"Question":"What is Ping?"," Answer":" \"Ping is a utility program that allows you to check connectivity between network devices on the network. You can ping a device by using its IP address or device name"},{"Question":"What are the maximum networks and hosts in class A, B, and C network?"," Answer":" \"For Class A there are 126 possible networks and 16,777,214 hosts. For Class B there are 16,384 possible networks and 65,534 hosts. For Class C there are 2,097,152 possible networks and 254 hosts"},{"Question":"What protocols fall under the Application layer of the TCP/IP stack?"," Answer":" \"The following are the protocols under the TCP/IP Application layer: FTP"},{"Question":"When you move the NIC cards from one PC to another PC, does the MAC address gets transferred as well?"," Answer":" \"Yes, that's because MAC addresses are hard-wired into the NIC circuitry, not the PC. This also means that a PC can have a different MAC address when another one replaced the NIC card."},{"Question":"What is SMTP?"," Answer":"SMTP is short for Simple Mail Transfer Protocol. This protocol deals with all internal mail and provides the necessary mail delivery services on the TCP/IP protocol stack."},{"Question":"What is multicast routing?"," Answer":"Multicast routing is a targeted form of broadcasting that sends a message to a selected group of the user instead of sending it to all users on a subnet."},{"Question":"Explain the importance of authentication."," Answer":"Authentication is the process of verifying a user's credentials before he can log into the network. It is normally performed using a username and password. This provides a secure means of limiting access from unwanted intruders on the network."},{"Question":"Why the standard OSI model is known as 802.xx?"," Answer":" \"The OSI model was started in February 1980. In 802.XX '80' stands for the year 1980, and '2' represents the month of February."},{"Question":"What Is TCP Three-Way Handshake?"," Answer":"TCP 3-way handshake is a process that is used in a TCP/IP network to make a connection between the server and client. It is a three-step process that requires both the client and server to exchange synchronization and acknowledgment packets before the real data communication process starts."},{"Question":"What is Stop-and-Wait Protocol?"," Answer":" \"In Stop and wait protocol"},{"Question":"What is bandwidth?"," Answer":"Every signal has a limit of upper range frequency and lower range frequency. The range of limit of network between its upper and lower frequency is called bandwidth."},{"Question":"What is a node and link?"," Answer":" \"A network is a connection setup of two or more computers directly connected by some physical mediums like optical fiber or coaxial cable. This physical medium of connection is known as a link"},{"Question":"What is the major difference between a gateway and router?"," Answer":"A router sends the data between two similar networks while gateway sends the data between two dissimilar networks."},{"Question":"What is POP3?"," Answer":"POP3 stands for Post Office Protocol version3. POP is responsible for accessing the mail service on a client machine. POP3 works on two models such as Delete mode and Keep mode."},{"Question":"What is multiplexing in networking?"," Answer":" \"In Networking"},{"Question":"What is the full form of RSA Algorithm? What is it used for?"," Answer":"RSA is short for Rivest-Shamir-Adleman algorithm. It is mostly used for public key encryption."},{"Question":"What is HTTPs and what port does it use?"," Answer":" \"HTTPs is a Secure HTTP. HTTPs is used for secure communication over a computer network. HTTPs provides authentication of websites that prevents unwanted attacks. In bi-directional communication"},{"Question":"What are ipconfig and ifconfig?"," Answer":" \"Ipconfig stands for Internet Protocol Configuration and this command is used on Microsoft Windows to view and configure the network interface. Ifconfig (Interface Configuration) is a command that is used on Linux"},{"Question":"What is SNMP?"," Answer":" \"SNMP stands for Simple Network Management Protocol. It is a network protocol used for collecting organizing and exchanging information between network devices. SNMP is widely used in network management for configuring network devices like switches"},{"Question":"What is the full form of IDEA?"," Answer":"IDEA stands for International Data Encryption Algorithm."},{"Question":"Define Piggybacking?"," Answer":" \"In data transmission"},{"Question":"Define Round Trip Time."," Answer":"The time taken for a signal to reach the destination and travel back to the sender with the acknowledgment is termed as Round Trip Time (RTT). It is also called Round Trip Delay (RTD)."},{"Question":"What is an Encoder?"," Answer":"Encoder is a circuit that uses an algorithm to convert any data or compress audio data or video data for transmission purposes. An encoder converts the analog signal into the digital signal.","qword":"encoder"}]}